---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyWall
source: html/0398e9c5-c675-6a80-abc9-a908046600b7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyWall Property

There is a circular chain of references among the highlighted elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularDependencyWall { get; }
```